# PressShowToSee Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EditingFailures..::..PressShowToSee Property
BuiltInFailures..::..EditingFailures Class See Also
---
Press Show to see the element(s); then Ignore or Cancel
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId PressShowToSee { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PressShowToSee As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ PressShowToSee {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EditingFailures Class
Autodesk.Revit.DB Namespace